In [2]:
import pandas as pd
import warnings
warnings.filterwarnings(action='ignore') # 경고를 인쇄하지 않음

import numpy as np
import scipy as sp
import pandas as pd
import matplotlib as mpl
import seaborn as sns

In [3]:
df  = pd.read_csv("data/titanic.csv")
df

   Surv    N   Class    Age     Sex
0    20   23    Crew  Adult  Female
1   192  862    Crew  Adult    Male
2     1    1   First  Child  Female
3     5    5   First  Child    Male
4    13   13  Second  Child  Female

In [4]:
df_xls = pd.read_excel('data/jeju_bank.xlsx', sheet_name='Sheet1')
df_xls.head(10)

           날짜    종가    시가    고가    저가     거래량
0  2020.06.09  3430  3455  3460  3410   24355
1  2020.06.08  3450  3490  3505  3435   38196
2  2020.06.05  3475  3460  3485  3430   33326
3  2020.06.04  3450  3480  3535  3400   89136
4  2020.06.03  3465  3410  3495  3410  126591
5  2020.06.02  3385  3300  3385  3300   67186
6  2020.06.01  3300  3285  3300  3240   26770
7  2020.05.29  3285  3250  3285  3230   28631
8  2020.05.28  3255  3240  3350  3210   74964
9  2020.05.27  3205  3210  3235  3185   22404

In [5]:
traffic_accident = pd.read_xml('data/traffic.xml', encoding='utf-8')
traffic_accident

     year      datetime     N daynight weekday
0     NaN           NaN   NaN     None    None
1  2016.0  2.016122e+09  35.0       야간       금
2  2016.0  2.016123e+09  48.0       주간       일
3  2016.0  2.016123e+09   5.0       야간       일

In [6]:
# 예제 데이터프레임 생성
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'Los Angeles', 'Chicago']}
dd = pd.DataFrame(data)

# 단일 컬럼 추출
print(dd['Name'])

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [7]:
# 여러 컬럼 추출
print(dd[['Name', 'City']])

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [8]:
# 단일 레코드 추출
print(dd.iloc[1])

Name            Bob
Age              30
City    Los Angeles
Name: 1, dtype: object

In [9]:
# 여러 레코드 추출
print(dd.iloc[0:2])

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

In [10]:
# 조건에 맞는 레코드 추출
print(dd[dd['Age'] > 25])

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago